task_app/app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses"
---
  def index
    @statuses = Status.all

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @status = Status.find(params[:id])

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("name", "isActive", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "In Progress"], ["isActive", false], ["created_at", "2019-07-10 09:17:46.155288"], ["updated_at", "2019-07-10 09:17:46.155288"]]
---
  def create
    @status = Status.new(params.require(:status).permit(:name, :isActive))
    puts @status
    if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "statuses" SET "isActive" = $1, "updated_at" = $2 WHERE "statuses"."id" = $3  [["isActive", false], ["updated_at", "2019-07-10 09:30:36.156070"], ["id", 2]]
---
  def update
    @status = Status.find(params[:id])
    if @status.update(params.require(:status).permit(:name, :isActive))

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "statuses" WHERE "statuses"."id" = $1  [["id", 4]]
---
  def destroy
    @status = Status.find(params[:id])
    @status.destroy